---
kind: other
id: Methods.T:Autodesk.Revit.DB.SlabEdgeType
source: html/a49a34cd-0171-8fd5-0d9f-43f1f6e3e7ac.htm
---
# SlabEdgeType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.